---
kind: other
id: Properties.T:Autodesk.Revit.DB.SweepProfile
source: html/3a99ad9f-f09e-c576-cd1a-a0d19da49c5d.htm
---
# SweepProfile Properties

Identifies if the object is read-only or modifiable.